[
  {
    "userId": 1,
    "message": "Hey, how's everyone doing today?"
  },
  {
    "userId": 2,
    "message": "I'm doing great, thanks for asking! How about you?"
  },
  {
    "userId": 3,
    "message": "I'm good too, just a bit tired from work. What about you, user_1?"
  },
  {
    "userId": 1,
    "message": "I'm doing alright, just taking it easy today."
  },
  {
    "userId": 4,
    "message": "Same here, I'm glad it's the weekend!"
  },
  {
    "userId": 2,
    "message": "Weekend plans anyone?"
  },
  {
    "userId": 3,
    "message": "I'm thinking of catching up on some movies. You?"
  },
  {
    "userId": 4,
    "message": "I'll probably just relax at home, maybe do some reading."
  },
  {
    "userId": 1,
    "message": "Sounds like a good plan! I might try out a new recipe."
  },
  {
    "userId": 2,
    "message": "Nice, let me know how it turns out!"
  },
  {
    "userId": 1,
    "message": "Sure thing! I'm planning to make a pasta dish."
  },
  {
    "userId": 3,
    "message": "Pasta sounds delicious! Do you have a specific recipe in mind?"
  },
  {
    "userId": 2,
    "message": "What kind of pasta are you making?"
  },
  {
    "userId": 1,
    "message": "I'm thinking of making spaghetti with a homemade marinara sauce."
  },
  {
    "userId": 4,
    "message": "Yum! That sounds amazing. Are you adding any meat or going vegetarian?"
  },
  {
    "userId": 1,
    "message": "I'm going vegetarian this time—just tomatoes, garlic, and fresh herbs."
  },
  {
    "userId": 3,
    "message": "That sounds so fresh and tasty. I might try that soon."
  },
  {
    "userId": 2,
    "message": "I’ve been trying to eat more vegetables lately, so that’s perfect!"
  },
  {
    "userId": 4,
    "message": "I need to do that too! Do you have any other veggie recipes?"
  },
  {
    "userId": 1,
    "message": "I have a great recipe for a roasted vegetable medley. Super simple and healthy."
  },
  {
    "userId": 3,
    "message": "That sounds good. What vegetables do you use?"
  },
  {
    "userId": 1,
    "message": "I usually go with carrots, zucchini, bell peppers, and some onions."
  },
  {
    "userId": 4,
    "message": "I love roasted carrots, they're so sweet when they're cooked that way!"
  },
  {
    "userId": 2,
    "message": "I think I’ll try that recipe. My grocery list is getting longer!"
  },
  {
    "userId": 3,
    "message": "Haha, same here! But I feel better when I cook at home."
  },
  {
    "userId": 1,
    "message": "Definitely. Cooking is so satisfying, and you know exactly what’s in your food."
  },
  {
    "userId": 2,
    "message": "I agree. I’ve been experimenting with different spices lately."
  },
  {
    "userId": 4,
    "message": "Ooh, what kind of spices?"
  },
  {
    "userId": 2,
    "message": "I've been using a lot of cumin and paprika lately. They add such a great flavor!"
  },
  {
    "userId": 3,
    "message": "Those are great choices! I love cumin in roasted vegetables."
  },
  {
    "userId": 1,
    "message": "I usually add some chili flakes for a little heat."
  },
  {
    "userId": 4,
    "message": "Nice! I’ll have to try that next time."
  },
  {
    "userId": 2,
    "message": "Have you guys tried turmeric in your cooking? It’s great for flavor and health benefits."
  },
  {
    "userId": 3,
    "message": "I use it in curries, but I should experiment with it more."
  },
  {
    "userId": 1,
    "message": "I’ve heard it’s really good for inflammation, so I try to use it when I can."
  },
  {
    "userId": 4,
    "message": "Yeah, I’ve read about its health benefits. I’ll add some to my next dish!"
  },
  {
    "userId": 2,
    "message": "By the way, have any of you tried the new cafe down the street?"
  },
  {
    "userId": 3,
    "message": "I’ve heard about it! Is it good?"
  },
  {
    "userId": 4,
    "message": "I’ve been there once, and their coffee is amazing."
  },
  {
    "userId": 1,
    "message": "I haven’t gone yet, but I’m definitely curious. What’s their signature drink?"
  },
  {
    "userId": 2,
    "message": "Their iced lattes are fantastic! They use almond milk and make it super creamy."
  },
  {
    "userId": 3,
    "message": "That sounds like something I’d love to try. I’m a sucker for iced coffee."
  },
  {
    "userId": 1,
    "message": "Iced lattes are the best! I’ll have to check it out this weekend."
  },
  {
    "userId": 4,
    "message": "Definitely do it! You won’t be disappointed."
  },
  {
    "userId": 2,
    "message": "What’s your go-to coffee order, user_1?"
  },
  {
    "userId": 1,
    "message": "I usually get a cappuccino with oat milk, but I’m open to trying new things."
  },
  {
    "userId": 3,
    "message": "I’m all about a flat white. I love the smoothness of it."
  },
  {
    "userId": 4,
    "message": "I’m a simple black coffee kind of person, but I’m always up for something new."
  },
  {
    "userId": 2,
    "message": "Black coffee is always a solid choice!"
  },
  {
    "userId": 1,
    "message": "True, you can’t go wrong with a good cup of black coffee."
  },
  {
    "userId": 3,
    "message": "I’m planning on doing a coffee tasting this weekend. Anyone interested?"
  },
  {
    "userId": 4,
    "message": "That sounds like fun! I’m in."
  },
  {
    "userId": 2,
    "message": "I’d love to join! I can bring some pastries."
  },
  {
    "userId": 1,
    "message": "Count me in too! I’ll bring some fruit and cheese."
  },
  {
    "userId": 3,
    "message": "Perfect! Let’s make it happen."
  },
  {
    "userId": 2,
    "message": "This is going to be so fun! I can’t wait."
  },
  {
    "userId": 4,
    "message": "Same here! We need to do this more often."
  },
  {
    "userId": 1,
    "message": "Agreed! We should make it a monthly thing."
  },
  {
    "userId": 3,
    "message": "I love that idea. Let’s definitely make it a regular event!"
  },
  {
    "userId": 2,
    "message": "I’m already looking forward to it!"
  },
  {
    "userId": 1,
    "message": "Alright, I’ll get the invites out later today."
  },
  {
    "userId": 4,
    "message": "I’ll bring some fresh flowers to brighten up the place."
  },
  {
    "userId": 2,
    "message": "Nice touch, user_4! I’ll bring some candles for ambiance."
  },
  {
    "userId": 3,
    "message": "I’ll bring some music to set the vibe."
  },
  {
    "userId": 1,
    "message": "This is shaping up to be an amazing gathering!"
  },
  {
    "userId": 4,
    "message": "Can’t wait to see everyone!"
  },
  {
    "userId": 2,
    "message": "It’s going to be great! Let’s make sure to take lots of pictures."
  },
  {
    "userId": 3,
    "message": "Definitely! This will be a day to remember."
  },
  {
    "userId": 1,
    "message": "Alright, I’ll see you all this weekend!"
  },
  {
    "userId": 4,
    "message": "See you soon!"
  },
  {
    "userId": 2,
    "message": "Looking forward to it!"
  },
  {
    "userId": 3,
    "message": "Me too, it’s going to be awesome!"
  }
]
